{
  "id": "uno-ooo-parser",
  "version": "0.1.15",
  "libre_office_ver": "7.2",
  "name": "CopyTableWizard",
  "type": "service",
  "namespace": "com.sun.star.sdb.application",
  "parser_args": {
    "sort": true,
    "long_names": true
  },
  "writer_args": {
    "include_desc": true
  },
  "data": {
    "from_imports": [
      [
        ".x_copy_table_wizard",
        "XCopyTableWizard",
        "x_copy_table_wizard_i"
      ]
    ],
    "from_imports_typing": [
      [
        "...task.x_interaction_handler",
        "XInteractionHandler",
        "task_x_interaction_handler_i"
      ],
      [
        "...beans.x_property_set",
        "XPropertySet",
        "beans_x_property_set_i"
      ]
    ],
    "extends_map": {
      "com.sun.star.sdb.application.XCopyTableWizard": "x_copy_table_wizard_i"
    },
    "quote": [
      "beans_x_property_set_i",
      "task_x_interaction_handler_i"
    ],
    "typings": [],
    "requires_typing": true,
    "name": "CopyTableWizard",
    "imports": [],
    "namespace": "com.sun.star.sdb.application",
    "extends": [
      "com.sun.star.sdb.application.XCopyTableWizard"
    ],
    "desc": [
      "describes a wizard which can be used to copy table like data from one database to another.",
      "",
      "**since**",
      "",
      "    OOo 2.4"
    ],
    "url": "https://api.libreoffice.org/docs/idl/ref/servicecom_1_1sun_1_1star_1_1sdb_1_1application_1_1CopyTableWizard.html",
    "items": {
      "methods": [
        {
          "name": "create",
          "returns": "None",
          "desc": [
            "creates an executable wizard dialog, which is to guide the user through copying a table from one database to another.",
            "",
            "At creation time, an attempt will be made to obtain the connections described by Source resp. Dest. Failing to do so will result in an exception.",
            "",
            "If the connection has been newly created by the wizard (e.g. because the data access descriptor specified a DataSource instead of an ActiveConnection), then this connection will be disposed upon disposal of the wizard.",
            "",
            "The following members of the DataAccessDescriptor are supported, and evaluated in the given order:",
            "",
            "The first 5 items are used to obtain the connection, the last two to determine which of the connection's objects is to be copied. Note that Command and CommandType are required.",
            "",
            "Additionally to the obvious restrictions (such as that creating a view is not possible if the copy source and the copy destination denote different databases), the following restrictions apply to the settings, and possible combinations:",
            "",
            "Violating any of the above restrictions will result in an error at creation time.",
            "",
            "Only DataSourceName, DatabaseLocation, ActiveConnection are supported, effectively describing the target connection to copy the data to. They're evaluated in the order mentioned here, so if multiple of the are present, only the first one is evaluated.",
            "",
            "Also, at the moment the connection which is implied by either of the settings above must support the com.sun.star.sdb.Connection service. In particular, it is not sufficient to pass an SDBC-level connection.",
            "",
            "Note that creating a view (see CopyTableOperation.CreateAsView) is not supported if the target connection is an SDBC-level connection only."
          ],
          "raises": [
            "",
            "",
            "com.sun.star.lang.WrappedTargetException"
          ],
          "args": [
            [
              "Source",
              "beans_x_property_set_i",
              "in"
            ],
            [
              "Destination",
              "beans_x_property_set_i",
              "in"
            ]
          ]
        },
        {
          "name": "createWithInteractionHandler",
          "returns": "None",
          "desc": [
            "creates an executable wizard dialog, which is to guide the user through copying a table from one database to another.",
            "",
            "The only difference to the create() constructor is that createWithInteractionHandler takes an additional argument, which can be used to intercept interactions (such as error messages) during the wizard run.",
            "",
            "When specifying this parameter, you should use an implementation supporting the com.sun.star.sdb.InteractionHandler, since the general-purpose com.sun.star.task.InteractionHandler cannot handle all requests described above."
          ],
          "raises": [
            "",
            "",
            "com.sun.star.lang.WrappedTargetException"
          ],
          "args": [
            [
              "Source",
              "beans_x_property_set_i",
              "in"
            ],
            [
              "Destination",
              "beans_x_property_set_i",
              "in"
            ],
            [
              "InteractionHandler",
              "task_x_interaction_handler_i",
              "in"
            ]
          ]
        }
      ]
    }
  }
}