{
  "id": "uno-ooo-parser",
  "version": "0.1.8",
  "timestamp": "2021-12-27 22:15:39+00:00",
  "name": "XCopyTableWizard",
  "type": "interface",
  "namespace": "com.sun.star.sdb.application",
  "parser_args": {
    "sort": true
  },
  "writer_args": {},
  "data": {
    "from_imports": [
      [
        "...ui.dialogs.x_executable_dialog",
        "XExecutableDialog"
      ]
    ],
    "from_imports_typing": [
      [
        ".x_copy_table_listener",
        "XCopyTableListener"
      ]
    ],
    "quote": [
      "XCopyTableListener"
    ],
    "typings": [],
    "requires_typing": true,
    "name": "XCopyTableWizard",
    "imports": [],
    "namespace": "com.sun.star.sdb.application",
    "extends": [
      "com.sun.star.ui.dialogs.XExecutableDialog"
    ],
    "desc": [
      "describes a wizard which can be used to copy table like data from one database to another.",
      "",
      "Copying table data between databases can be a complex task. Especially when it comes to matching field types in the source and in the target database, some heuristics, and sometimes support from the user doing the operation, are required.",
      "",
      "The copy table wizard described by this interfaces cares for those, and other, settings.",
      "",
      "**since**",
      "",
      "    OOo 2.4"
    ],
    "url": "https://api.libreoffice.org/docs/idl/ref/interfacecom_1_1sun_1_1star_1_1sdb_1_1application_1_1XCopyTableWizard.html",
    "items": {
      "methods": [
        {
          "name": "addCopyTableListener",
          "returns": "None",
          "desc": [
            "adds a listener which is to be notified of progress in the copy operation"
          ],
          "raises": [],
          "args": [
            [
              "Listener",
              "XCopyTableListener",
              "in"
            ]
          ]
        },
        {
          "name": "removeCopyTableListener",
          "returns": "None",
          "desc": [
            "removes a listener"
          ],
          "raises": [],
          "args": [
            [
              "Listener",
              "XCopyTableListener",
              "in"
            ]
          ]
        }
      ],
      "properties": [
        {
          "name": "CreatePrimaryKey",
          "returns": "object",
          "desc": [
            "specifies that a new primary key is to be created in the target database",
            "",
            "At initialization time, you can specify the initial settings for the primary key in the UI.",
            "",
            "You cannot use this attribute to determine the primary key, possibly created by the wizard, after it finished. The reason is that during the wizard run, the user can define an arbitrarily complex primary key, e.g. including multiple columns, which cannot be represented in this simple attribute anymore.",
            "",
            "This attribute is ignored if Operation is CopyTableOperation.AppendData.",
            "",
            "Changing this attribute while the dialog is running is not supported, the result of such an attempt is undefined.",
            "",
            "When a primary key is to be created by the wizard, it will be an auto-increment column, if possible."
          ],
          "raises_get": "",
          "raises_set": ""
        },
        {
          "name": "DestinationTableName",
          "returns": "str",
          "desc": [
            "specifies the name of the table in the destination database.",
            "",
            "At initialization time, you can use this attribute to control the initial table name as suggested to the user.",
            "",
            "After the wizard has finished, you can use this attribute to determine what table was actually created resp. to which existing table the source table's data was appended.",
            "",
            "Changing this attribute while the dialog is running is not supported, the result of such an attempt is undefined."
          ],
          "raises_get": "",
          "raises_set": ""
        },
        {
          "name": "Operation",
          "returns": "int",
          "desc": [
            "specifies the basic operation for the wizard to execute.",
            "",
            "This must be one of the CopyTableOperation constants.",
            "",
            "At initialization time, you can use this attribute to control the initial operation in the wizard.",
            "",
            "After the wizard has finished, you can use this attribute to determine what operation was actually executed.",
            "",
            "Changing this attribute while the dialog is running is not supported, the result of such an attempt is undefined."
          ],
          "raises_get": "",
          "raises_set": ""
        },
        {
          "name": "UseHeaderLineAsColumnNames",
          "returns": "bool",
          "desc": [
            "specifies that the first row should be used to identify column names.",
            "",
            "This attribute is ignored when the source defines the column names which isn't the case when only a part of a table should be copied e.g. in the RTF format or in the HTML format."
          ],
          "raises_get": "",
          "raises_set": ""
        }
      ]
    }
  }
}