{
  "id": "uno-ooo-parser",
  "version": "0.1.12",
  "timestamp": "2022-01-03 04:03:37+00:00",
  "name": "AdministrationProvider",
  "type": "service",
  "namespace": "com.sun.star.configuration",
  "parser_args": {
    "sort": true
  },
  "writer_args": {
    "include_desc": true
  },
  "data": {
    "from_imports": [
      [
        "..lang.x_component",
        "XComponent"
      ],
      [
        "..lang.x_multi_service_factory",
        "XMultiServiceFactory"
      ]
    ],
    "from_imports_typing": [],
    "quote": [],
    "typings": [],
    "requires_typing": false,
    "name": "AdministrationProvider",
    "imports": [],
    "namespace": "com.sun.star.configuration",
    "extends": [
      "com.sun.star.lang.XMultiServiceFactory",
      "com.sun.star.lang.XComponent"
    ],
    "desc": [
      "manages one, or more, complete sets of configuration data for administrative purposes and serves as a factory for objects that provide access to subsets of these shared configurations.",
      "",
      "Shared sets of configuration data usually serve to provide defaults, which are used if no individual settings are present. Depending on the data store multiple layers of defaults may be combined with a user-specific layer to make up the final configuration.",
      "",
      "Many aspects of the supported behavior depend strongly on the underlying data store and on the administrative structures it defines. With some data stores this service also enables access to individual user's configuration data by an administrator.",
      "",
      "On the other hand, in the simplest model there is only a single layer of default data which is accessible through this service.",
      "",
      "An implementation is usually obtained from a com.sun.star.lang.ServiceManager. The arguments passed to com.sun.star.lang.XMultiComponentFactory.createInstanceWithArgumentsAndContext() select the configuration data source. They may also define the scope of administrable data or contain credentials to be used to authorize the administrative access. Missing parameters may be filled in from the context or the environment.",
      "",
      "A ConfigurationProvider provides access to the personal layer of configuration data of the current user context. It should in most cases be used when using the configuration data, although for most contexts an AdministrationProvider can be used as a drop-in replacement."
    ],
    "url": "https://api.libreoffice.org/docs/idl/ref/servicecom_1_1sun_1_1star_1_1configuration_1_1AdministrationProvider.html",
    "items": {}
  }
}