{
  "id": "uno-ooo-parser",
  "version": "0.1.23",
  "libre_office_ver": "7.2",
  "name": "FrameAction",
  "type": "enum",
  "namespace": "com.sun.star.frame",
  "parser_args": {
    "sort": true
  },
  "writer_args": {
    "include_desc": true
  },
  "data": {
    "name": "FrameAction",
    "namespace": "com.sun.star.frame",
    "url": "https://api.libreoffice.org/docs/idl/ref/namespacecom_1_1sun_1_1star_1_1frame.html#a793fdb3e5cab69d63a9c89b5e4f83dfd",
    "allow_db": true,
    "quote": [],
    "typings": [],
    "desc": "",
    "items": [
      {
        "name": "COMPONENT_ATTACHED",
        "value": "COMPONENT_ATTACHED",
        "desc": [
          "an event of this kind is broadcast whenever a component is attached to a frame",
          "",
          "This is almost the same as the instantiation of the component within that frame. The component is attached to the frame immediately before this event is broadcast."
        ]
      },
      {
        "name": "COMPONENT_DETACHING",
        "value": "COMPONENT_DETACHING",
        "desc": [
          "an event of this kind is broadcast whenever a component is detaching from a frame",
          "",
          "This is quite the same as the destruction of the component which was in that frame. At the moment when the event is broadcast the component is still attached to the frame but in the next moment it won't."
        ]
      },
      {
        "name": "COMPONENT_REATTACHED",
        "value": "COMPONENT_REATTACHED",
        "desc": [
          "an event of this kind is broadcast whenever a component is attached to a new model.",
          "",
          "In this case the component remains the same but operates on a new model component."
        ]
      },
      {
        "name": "CONTEXT_CHANGED",
        "value": "CONTEXT_CHANGED",
        "desc": [
          "an event of this kind is broadcast whenever a component changes its internal context (i.e., the selection).",
          "",
          "If the activation status within a frame changes, this counts as a context change too."
        ]
      },
      {
        "name": "FRAME_ACTIVATED",
        "value": "FRAME_ACTIVATED",
        "desc": [
          "an event of this kind is broadcast whenever a component gets activated",
          "",
          "Activations are broadcast from the top component which was not active before, down to the inner most component."
        ]
      },
      {
        "name": "FRAME_DEACTIVATING",
        "value": "FRAME_DEACTIVATING",
        "desc": [
          "an event of this kind is broadcasted immediately before the component is deactivated",
          "",
          "Deactivations are broadcast from the innermost component which does not stay active up to the outer most component which does not stay active."
        ]
      },
      {
        "name": "FRAME_UI_ACTIVATED",
        "value": "FRAME_UI_ACTIVATED",
        "desc": [
          "an event of this kind is broadcast by an active frame when it is getting UI control (tool control)."
        ]
      },
      {
        "name": "FRAME_UI_DEACTIVATING",
        "value": "FRAME_UI_DEACTIVATING",
        "desc": [
          "an event of this kind is broadcast by an active frame when it is losing UI control (tool control)."
        ]
      }
    ]
  }
}