{
  "id": "uno-ooo-parser",
  "version": "0.1.26",
  "libre_office_ver": "7.2",
  "name": "ChartAxisLabelPosition",
  "type": "enum",
  "namespace": "com.sun.star.chart",
  "parser_args": {
    "sort": true
  },
  "writer_args": {
    "include_desc": true
  },
  "data": {
    "name": "ChartAxisLabelPosition",
    "namespace": "com.sun.star.chart",
    "url": "https://api.libreoffice.org/docs/idl/ref/namespacecom_1_1sun_1_1star_1_1chart.html#a693b6b549818a6055effeaf72501bd26",
    "allow_db": true,
    "quote": [],
    "typings": [],
    "desc": "",
    "items": [
      {
        "name": "NEAR_AXIS",
        "value": "NEAR_AXIS",
        "desc": [
          "The labels are placed adjacent to the axis.",
          "",
          "When the axis itself is placed at the minimum or maximum of the scale ( that is when the property CrossoverPosition equals ChartAxisPosition_MINIMUM or ChartAxisPosition_MAXIMUM) the labels are placed outside the coordinate system. Otherwise the labels are placed adjacent to the axis on that side that belongs to the lower values on the crossing axis. E.g. when the ChartAxisLabelPosition is set to NEAR_AXIS for an y axis the labels are placed adjacent to the y axis on that side that belongs to the lower x values."
        ]
      },
      {
        "name": "NEAR_AXIS_OTHER_SIDE",
        "value": "NEAR_AXIS_OTHER_SIDE",
        "desc": [
          "The labels are placed adjacent to the axis on the opposite side as for NEAR_AXIS."
        ]
      },
      {
        "name": "OUTSIDE_END",
        "value": "OUTSIDE_END",
        "desc": [
          "The labels are placed outside the coordinate region on that side where the crossing axis has its maximum value.",
          "",
          "E.g. when this is set for an y axis the labels are placed outside the diagram on that side where to the x axis has its maximum value."
        ]
      },
      {
        "name": "OUTSIDE_START",
        "value": "OUTSIDE_START",
        "desc": [
          "The labels are placed outside the coordinate region on that side where the crossing axis has its minimum value.",
          "",
          "E.g. when this is set for an y axis the labels are placed outside the diagram on that side where to the x axis has its minimum value."
        ]
      }
    ]
  }
}