{
  "id": "uno-ooo-parser",
  "version": "0.1.12",
  "timestamp": "2022-01-01 23:31:23+00:00",
  "name": "UriReferenceFactory",
  "type": "service",
  "namespace": "com.sun.star.uri",
  "parser_args": {
    "sort": true
  },
  "writer_args": {
    "include_desc": true
  },
  "data": {
    "from_imports": [
      [
        ".x_uri_reference_factory",
        "XUriReferenceFactory"
      ]
    ],
    "quote": [],
    "typings": [],
    "requires_typing": false,
    "name": "UriReferenceFactory",
    "namespace": "com.sun.star.uri",
    "extends": [
      "com.sun.star.uri.XUriReferenceFactory"
    ],
    "url": "https://api.libreoffice.org/docs/idl/ref/servicecom_1_1sun_1_1star_1_1uri_1_1UriReferenceFactory.html",
    "desc": [
      "creates URI references.",
      "",
      "See RFC 3986 for a description of URI references and related terms.",
      "",
      "For parsing absolute URI references, this service tries to use a scheme-specific parser. Such a scheme-specific parser will typically enforce additional restrictions during parsing, and will typically return objects that support extra, scheme-specific interfaces in addition to com.sun.star.uri.XUriReference. If no such parser is found, and for relative URI references, a generic parser is used, which returns objects that only support com.sun.star.uri.XUriReference.",
      "",
      "Locating a scheme-specific parser works as follows: A scheme consists of Latin capital letters “A”–“Z”, Latin small letters “a”–“z”, digits “0”–“9”, “+”, “-”, and “.”. A scheme s is transformed into a string s′ character-by-character, by translating Latin capital letters to their small counterparts, translating “+” to “PLUS”, “-” to “HYPHEN”, “.” to “DOT”, and copying Latin small letters and digits unchanged. If the component context used while creating this UriReferenceFactory instance offers a service manager, and there is a service available at that service manager whose name is the concatenation of “com.sun.star.uri.UriSchemeParser_” and s′, then that service is used. It is an error if that service does not support com.sun.star.uri.XUriSchemeParser.",
      "",
      "**Since**",
      "",
      "    OOo 2.0"
    ]
  }
}