{
  "id": "uno-ooo-parser",
  "version": "0.1.10",
  "timestamp": "2021-12-31 23:42:23+00:00",
  "name": "NestedRegistry",
  "type": "service",
  "namespace": "com.sun.star.registry",
  "parser_args": {
    "sort": true
  },
  "writer_args": {
    "include_desc": true
  },
  "data": {
    "from_imports": [
      [
        ".x_simple_registry",
        "XSimpleRegistry"
      ],
      [
        "..lang.x_initialization",
        "XInitialization"
      ]
    ],
    "quote": [],
    "typings": [],
    "requires_typing": false,
    "name": "NestedRegistry",
    "namespace": "com.sun.star.registry",
    "extends": [
      "com.sun.star.registry.XSimpleRegistry",
      "com.sun.star.lang.XInitialization"
    ],
    "url": "https://api.libreoffice.org/docs/idl/ref/servicecom_1_1sun_1_1star_1_1registry_1_1NestedRegistry.html",
    "desc": [
      "supports a shared view on two different registries.",
      "",
      "The registry files will be opened in two different modes, registry1 will be opened with read/write rights and registry2 will be opened read-only. In the context of this service, the functions open, close, and destroy from XSimpleRegistry are not supported and throw an exception if they are used.",
      "",
      "Functions of XSimpleRegistry:",
      "",
      "returns the name of registry1.",
      "",
      "checks if registry1 is valid. If the interface is not NULL then registry1 should always be valid.",
      "",
      "merges all information from the specified registry in registry1.",
      "",
      "Functions of XRegistryKey:",
      "",
      "returns a virtual key which is specified in registry1 or registry2.",
      "",
      "deletes the key only if it is present in registry1.",
      "",
      "sets the value at the specified key in registry1.",
      "",
      "returns the value at the specified key in registry1, or if the value is not present in registry1, it will return the value of registry2.",
      "",
      "returns a sequence of all subkeys in both registries.",
      "",
      "returns a sequence with the names of all subkeys in both registries.",
      "",
      "How to initialize the registries:",
      "Use a sequence of XSimpleRegistry with two elements. The first element must be the registry which is opened with read/write rights and the second element must be the read-only one.",
      "Two different ways are possible:",
      "",
      "Guarantees:"
    ]
  }
}