{
  "id": "uno-ooo-parser",
  "version": "0.1.22",
  "libre_office_ver": "7.2",
  "name": "AnimationEndSync",
  "type": "const",
  "namespace": "com.sun.star.animations",
  "parser_args": {
    "sort": false,
    "remove_parent_inherited": true
  },
  "writer_args": {
    "hex": false,
    "flags": false,
    "include_desc": true
  },
  "data": {
    "name": "AnimationEndSync",
    "namespace": "com.sun.star.animations",
    "url": "https://api.libreoffice.org/docs/idl/ref/namespacecom_1_1sun_1_1star_1_1animations_1_1AnimationEndSync.html",
    "flags": false,
    "base_class": "ConstIntBase",
    "allow_db": true,
    "quote": [],
    "typings": [],
    "requires_typing": false,
    "from_imports": [],
    "from_imports_typing": [],
    "fullname": "com.sun.star.animations.AnimationEndSync",
    "desc": [],
    "items": [
      {
        "name": "FIRST",
        "type": "int",
        "value_type": "INTEGER",
        "value": 0,
        "lines": [
          "The par, excl, or media element's implicit duration ends with the earliest active end of all the child elements.",
          "",
          "This does not refer to the lexical first child, or to the first child to start, but rather refers to the first child to end its (first) active duration."
        ]
      },
      {
        "name": "LAST",
        "type": "int",
        "value_type": "INTEGER",
        "value": 1,
        "lines": [
          "The par, excl, or media element's implicit duration ends with the last active end of the child elements.",
          "",
          "This does not refer to the lexical last child, or to the last child to start, but rather refers to the last active end of all children that have a resolved, definite begin time. If the time container has no children with a resolved begin time, the time container ends immediately. If child elements have multiple begin times, or otherwise restart, the child elements must complete all instances of active durations for resolved begin times. This is the default value for par and excl elements."
        ]
      },
      {
        "name": "ALL",
        "type": "int",
        "value_type": "INTEGER",
        "value": 2,
        "lines": [
          "The par, excl, or media element's implicit duration ends when all of the child elements have ended their respective active durations.",
          "",
          "Elements with indefinite or unresolved begin times will keep the simple duration of the time container from ending. When all elements have completed the active duration one or more times, the parent time container can end."
        ]
      },
      {
        "name": "MEDIA",
        "type": "int",
        "value_type": "INTEGER",
        "value": 3,
        "lines": [
          "The time container element's implicit duration ends when the intrinsic media duration of the element ends.",
          "",
          "This must be defined by a host language. If the time container element does not define an intrinsic media duration, the host language must define the simple duration for the element. This is the default value for media time container elements."
        ]
      }
    ]
  }
}