{
  "id": "uno-ooo-parser",
  "version": "0.1.14",
  "libre_office_ver": "7.2",
  "name": "XSQLData",
  "type": "interface",
  "namespace": "com.sun.star.sdbc",
  "parser_args": {
    "sort": true
  },
  "writer_args": {
    "include_desc": true
  },
  "data": {
    "from_imports": [
      [
        "..uno.x_interface",
        "XInterface"
      ]
    ],
    "from_imports_typing": [
      [
        ".xsql_input",
        "XSQLInput"
      ],
      [
        ".xsql_output",
        "XSQLOutput"
      ]
    ],
    "quote": [
      "XSQLInput",
      "XSQLOutput"
    ],
    "typings": [],
    "requires_typing": true,
    "name": "XSQLData",
    "imports": [],
    "namespace": "com.sun.star.sdbc",
    "extends": [
      "com.sun.star.uno.XInterface"
    ],
    "desc": [
      "is used for the custom mapping of SQL user-defined types.",
      "",
      "This interface must be implemented by a service that is registered in a type mapping. It is expected that this interface will normally be implemented by a tool. The methods in this interface are called by the driver and are never called by a programmer directly."
    ],
    "url": "https://api.libreoffice.org/docs/idl/ref/interfacecom_1_1sun_1_1star_1_1sdbc_1_1XSQLData.html",
    "items": {
      "methods": [
        {
          "name": "getSQLTypeName",
          "returns": "str",
          "desc": [
            "returns the fully-qualified name of the SQL user-defined type that this object represents.",
            "",
            "This method is called by the SDBC driver to get the name of the UDT instance that is being mapped to this instance of SQLData."
          ],
          "raises": [
            "SQLException"
          ],
          "args": []
        },
        {
          "name": "readSQL",
          "returns": "None",
          "desc": [
            "populates this object with data read from the database.",
            "",
            "The implementation of the method must follow this protocol:",
            "It must read each of the attributes or elements of the SQL type from the given input stream. This is done by calling a method of the input stream to read each item, in the order that they appear in the SQL definition of the type. The method readSQL then assigns the data to appropriate fields or elements (of this or other objects).",
            "Specifically, it must call the appropriate XSQLInput.readXXX method(s) to do the following: for a Distinct Type, read its single data element; for a Structured Type, read a value for each attribute of the SQL type.",
            "",
            "The SDBC driver initializes the input stream with a type map before calling this method, which is used by the appropriate SQLInput.readXXX method on the stream."
          ],
          "raises": [
            "SQLException"
          ],
          "args": [
            [
              "stream",
              "XSQLInput",
              "in"
            ],
            [
              "typeName",
              "str",
              "in"
            ]
          ]
        },
        {
          "name": "writeSQL",
          "returns": "None",
          "desc": [
            "writes this object to the given SQL data stream.",
            "",
            "The implementation of the method must follow this protocol:",
            "It must write each of the attributes of the SQL type to the given output stream. This is done by calling a method of the output stream to write each item, in the order that they appear in the SQL definition of the type. Specifically, it must call the appropriate XSQLOutput.writeXXX method(s) to do the following:",
            "for a Distinct Type, write its single data element; for a Structured Type, write a value for each attribute of the SQL type."
          ],
          "raises": [
            "SQLException"
          ],
          "args": [
            [
              "stream",
              "XSQLOutput",
              "in"
            ]
          ]
        }
      ]
    }
  }
}